https://github.com/okovtun/BV021
https://www.youtube.com/watch?v=q3vDUsUlsZQ&list=PLFkgzpHG4CYWNTJgB6ZQ7waGXpb5jg0G2&index=2&t=1497s

////////////////////////////////////////////////////////////////////
/////////////////	Discord: okovtun#7508	////////////////////
////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------//
//			Operators
http://cplusplus.com/doc/tutorial/operators/

TODO:
1. Вывести таблицу ASCII-символов по 16 символов в строке, разделяя их пробелом;
2. Вывести на экран таблицу Пифагора;
3. Вывести в консоль все фигуры из файла Geometria.txt


DONE:
Написать программу, которая возводит число в степень. Основание и показатель степени вводятся с клавиатуры.

DONE:
1. Написать программу, которая определяет, является ли введенное число Палиндромом. 12321, 1221.

DONE:
1. Обеспечить выход из цикла нажатием клавиши Escape;
2. Написать программу "Shooter", которая, при нажатии на соответстующую клавишу WASD выводит на экран слово: "Вперед", "Назад", "Влево", "Вправо", Space - Прыжок, Enter - Огонь.

DONE:
1. Выучить теорию!!!!!!!!!!
2. Решить задчи в ControlStructures\Task\if tasks.txt

DONE:
1. Выучить конспект!!!
2.	int i=3;
	i=i++ + 1 + ++i *=2;
	cout << i << endl;

	int i=3;
	i += i++ + 1 + ++i *=2;
	cout << i << endl;

DONE:
2. Решить задачи из *.pdf-файла.

DONE:
2. Используя оператор sizeof, и макроопределения Visual Studio вывести в окно консоли информацию о следующих типах данных: long, long long, float, double;


DONE:
2. Вывести в окно консоли стишок "В лесу родилась Ёлочка". Стишок должен быть выровнен по середине окна консоли, а также, куплеты должны быть разделены пустой строкой.


DONE:
2. Установить Visual Studio, кто этого еще не сделал.
3. В MyStat прислать исходный код программы HelloWorld.
