https://github.com/okovtun/BV021
https://www.youtube.com/watch?v=q3vDUsUlsZQ&list=PLFkgzpHG4CYWNTJgB6ZQ7waGXpb5jg0G2&index=2&t=1497s
https://www.youtube.com/watch?v=18c3MTX0PK0&list=PLlrATfBNZ98dudnM48yfGUldqGD0S4FFb
https://drive.google.com/drive/folders/0By6mLf1ZlXtTTXhLd3k0dnB0UVk?usp=sharing


////////////////////////////////////////////////////////////////////
/////////////////	Discord: okovtun#7508	////////////////////
////////////////////////////////////////////////////////////////////

TODO:
Объявить массив из пяти элементов. 
1. Ввести значения его элементов с клавиатуры;
2. Вывести их на экран в прямом и обратном порядке (одна строка в прямом, под ней в обратном);
3. Вычислить сумму элементов массива;
4. Вычислить среднее арифметическое элементов массива;
5. Найти минимальное и максимальное значение в массиве, и вывести их на экран.


//-----------------------------------------------------------------//
//			Operators
http://cplusplus.com/doc/tutorial/operators/

DONE:
HardChess.txt

DONE:
1. Добить задачку про unsigned char;
2. 
	+ - + - +
	- + - + -
	+ - + - +
	- + - + -
	+ - + - +
n^2 n XOR 2
n*n
pow(n, 2);


DONE:
1. Вывести таблицу ASCII-символов по 16 символов в строке, разделяя их пробелом;
2. Вывести на экран таблицу Пифагора;
3. Вывести в консоль все фигуры из файла Geometria.txt


DONE:
Написать программу, которая возводит число в степень. Основание и показатель степени вводятся с клавиатуры.

DONE:
1. Написать программу, которая определяет, является ли введенное число Палиндромом. 12321, 1221.

DONE:
1. Обеспечить выход из цикла нажатием клавиши Escape;
2. Написать программу "Shooter", которая, при нажатии на соответстующую клавишу WASD выводит на экран слово: "Вперед", "Назад", "Влево", "Вправо", Space - Прыжок, Enter - Огонь.

DONE:
1. Выучить теорию!!!!!!!!!!
2. Решить задчи в ControlStructures\Task\if tasks.txt

DONE:
1. Выучить конспект!!!
2.	int i=3;
	i=i++ + 1 + ++i *=2;
	cout << i << endl;

	int i=3;
	i += i++ + 1 + ++i *=2;
	cout << i << endl;

DONE:
2. Решить задачи из *.pdf-файла.

DONE:
2. Используя оператор sizeof, и макроопределения Visual Studio вывести в окно консоли информацию о следующих типах данных: long, long long, float, double;


DONE:
2. Вывести в окно консоли стишок "В лесу родилась Ёлочка". Стишок должен быть выровнен по середине окна консоли, а также, куплеты должны быть разделены пустой строкой.


DONE:
2. Установить Visual Studio, кто этого еще не сделал.
3. В MyStat прислать исходный код программы HelloWorld.
